src/DataProcessors/ПечатьКарточкаКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ПечатьКарточкаКлиента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокНастроек</Name>
					<Comment>Список настроек</Comment>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьДопКонтИнф</Name>
					<Comment>Выводить дополнительную контактную информацию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьТолькоОсновные</Name>
					<Comment>Выводить только основные</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФормыНастроек</Name>
					<Comment>Текущее имя формы настроек</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакетаОформленияТабличногоДокумента</Name>
					<Comment>Имя макета оформления табличного документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыводаОтчета</Name>
					<Comment>Режим отображения: табличный документ, сводная таблица, диаграмма</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыВыводаОтчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Comment>Вид отчета: обороты, остатки, остатки и обороты</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/КонтактныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КонтактныеЛица</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Взаимоотношение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВзаимоотношений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Comment>Основной</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Кураторы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Кураторы</Name>
			<Comment>Предназначен для регистрации кураторов в разрезе контрагентов, контактных лиц, договоров</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий (зона ответственности)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент, к которому приставлен куратор </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Куратор</Name>
					<Comment>Сотрудник (менеджер), приставленный к контрагенту</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Comment>Договор с контрагентом, с которым работает данный куратор</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/НакопленияПоКарточкамКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>НакопленияПоКарточкамКонтрагентов</Name>
			<Comment>Накопления по карточкам контрагентов</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЧеков</Name>
					<Comment>Количество чеков в документе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоНоменклатуры</Name>
					<Comment>Количество номенклатуры в документе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Карточка</Name>
					<Comment>Карточка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ФормыСобственности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыСобственности</Name>
			<Comment>Варианты форм собственности контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Comment>Любая форма юридического лица</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
					<Comment>Индивидуальный предприниматель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
					<Comment>Частное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочаяФормаСобственности</Name>
					<Comment>Прочий вид собственности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Comment>Обособленное подразделение</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
			<Comment>Виды контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>Основное взаимодействие с контрагентом - продажа, передача на комиссию, хранение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Основное взаимодействие с контрагентом - закупка и принятие на комиссию, хранение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодотчетноеЛицо</Name>
					<Comment>Подотчетное лицо компании</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Филиал</Name>
					<Comment>Филиал компании, одна из организаций</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собственник</Name>
					<Comment>Собственник компании, осуществляющий финансирование</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Comment>Контактное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочие контрагенты</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производитель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<Comment>Банковские счета</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.ПодразделенияКомпании</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСчета</Name>
					<Comment>Вид банковского счета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Comment>Номер расчетного счета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Comment>Валюта, в которой хранятся денежные средства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Comment>Банк, в котором открыт счет</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторБанковРФ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкДляРасчетов</Name>
					<Comment>Банк для случая непрямых расчетов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторБанковРФ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцПрописью</Name>
					<Comment>Указывать в дате документа месяц прописью</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Comment>Дата открытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Comment>Дата закрытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИДатаРазрешения</Name>
					<Comment>Номер и дата разрешения открытия счета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБезКопеек</Name>
					<Comment>Указывать сумму без копеек, если она является целым числом</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПМастерКлюч</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПЗначениеСчетчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРППризнакНовый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ПечатьКарточкаКлиента/Ext/ManagerModule.bsl
// Модуль менеджера обработки "ПечатьКонвертовНаклеек"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура обработки печати.
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_КарточкаКлиента") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПФ_MXL_КарточкаКлиента",
															НСтр("ru = 'Карточка клиента'"),
															СформироватьТабличныйДокумент(МассивОбъектов, ОбъектыПечати, ПараметрыПечати.СтруктураНастроек));
	КонецЕсли;													
КонецПроцедуры

Функция СформироватьТабличныйДокумент(МассивОбъектов, ОбъектыПечати ,СтруктураНастроек = Неопределено)

	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПечатьКарточкаКлиента";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;
	
	ПервыйДокумент = Истина;
	Для Каждого ТекущийОбъект Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Зададим параметры макета
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		
		// Получим данные из документа
		Если ЗначениеЗаполнено(СтруктураНастроек) Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьКарточкаКлиента.ПФ_MXL_КарточкаКлиента");
			
			ОбластьОтступа0 = Макет.ПолучитьОбласть("СтрокаОтступа0");
			ОбластьОтступа1 = Макет.ПолучитьОбласть("СтрокаОтступа1");
			ОбластьЗаголовкаРаздела = Макет.ПолучитьОбласть("НазваниеРаздела");
			
			// Построим заголовок
			ОбластьЗаголовка = Макет.ПолучитьОбласть("Заголовок");
			ОбластьЗаголовка.Параметры.Контрагент = ТекущийОбъект.Ссылка;
			
			ТабличныйДокумент.Вывести(ОбластьЗаголовка);
			ТабличныйДокумент.Вывести(ОбластьОтступа0);
			
			// Основные сведения
			СписокОсновныхСведений = Новый СписокЗначений();
			СписокОсновныхСведений.Добавить(ТекущийОбъект.Ссылка.НаименованиеПолное, НСтр("ru = 'Полное наименование'"));
			СписокОсновныхСведений.Добавить(ТекущийОбъект.Ссылка.ВидКонтрагента, НСтр("ru = 'Вид контрагента'"));
			СписокОсновныхСведений.Добавить(ТекущийОбъект.Ссылка.ФормаСобственности, НСтр("ru = 'Форма собственности'"));
			СписокОсновныхСведений.Добавить(ТекущийОбъект.Ссылка.Сотрудник, "Сотрудник");
			СписокОсновныхСведений.Добавить(ТекущийОбъект.Ссылка.Филиал, "Филиал");
			
			ОбластьЗаголовка = Макет.ПолучитьОбласть("СтрокаОсновныеСведения");
			Для Каждого ЭлементСпискаОсновныхСведений Из СписокОсновныхСведений Цикл
				Если ЗначениеЗаполнено(ЭлементСпискаОсновныхСведений.Значение) Тогда
					Если ЭлементСпискаОсновныхСведений.Представление = НСтр("ru = 'Полное наименование'") Тогда
						ОбластьЗаголовка.Параметры.ПараметрРасшифровки = ТекущийОбъект.Ссылка;	
					Иначе
						ОбластьЗаголовка.Параметры.ПараметрРасшифровки = Неопределено;	
					КонецЕсли;	
					ОбластьЗаголовка.Параметры.НазваниеОсновногоПараметра = ЭлементСпискаОсновныхСведений.Представление;
					ОбластьЗаголовка.Параметры.ЗначениеОсновногоПараметра = ЭлементСпискаОсновныхСведений.Значение;
					ТабличныйДокумент.Вывести(ОбластьЗаголовка);
					           
					// Получим таблицу кураторов контрагента
					ВыводитьКонтактнуюИнформациюКонтактныхЛиц = СтруктураНастроек.СписокНастроек.НайтиПоЗначению("КонтактнаяИнформацияКЛ").Пометка;
					ВыводитьПодтверждающиеДокументыКонтактныхЛиц = СтруктураНастроек.СписокНастроек.НайтиПоЗначению("ПодтверждающиеДокументыКЛ").Пометка;
					ВыводитьДополнительнуюИнформациюКонтактныхЛиц = СтруктураНастроек.СписокНастроек.НайтиПоЗначению("ДополнительнаяИнформацияКЛ").Пометка;
				КонецЕсли;
			КонецЦикла;
			ТабличныйДокумент.НачатьАвтогруппировкуСтрок();	
			Для Каждого ЭлементСпискаНастроек Из СтруктураНастроек.СписокНастроек Цикл
				ТекущийРаздел = ЭлементСпискаНастроек.Значение;
				Если (ТекущийРаздел = "КонтактнаяИнформацияКЛ")
				 Или (ТекущийРаздел = "ПодтверждающиеДокументыКЛ")
			 	 Или (ТекущийРаздел = "ДополнительнаяИнформацияКЛ") Тогда		 
					Продолжить;
				КонецЕсли;	
				Если ЭлементСпискаНастроек.Пометка Тогда
					
					Если ((ТекущийРаздел = "РегистрационнаяИнформация") И (ТекущийОбъект.Ссылка.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо)) Тогда
						ТекущийРаздел = "РегистрационнаяИнформацияЧастноеЛицо";
					КонецЕсли;	
					ТаблицаДанных = ТаблицаДанныхРаздела(ТекущийРаздел, ТекущийОбъект.Ссылка, СтруктураНастроек.ВыводитьТолькоОсновные);
					Если ТаблицаДанных.Количество() > 0 Тогда
						ТабличныйДокумент.Вывести(ОбластьОтступа0, 0);
						ОбластьЗаголовкаРаздела.Параметры.НаименованиеРаздела = ЭлементСпискаНастроек.Представление;
						ТабличныйДокумент.Вывести(ОбластьЗаголовкаРаздела, 0);
						
						ТабличныйДокумент.Вывести(ОбластьОтступа1, 1);
						Если (СтрНайти(ТекущийРаздел, "РегистрационнаяИнформация") = 1) Или (ТекущийРаздел = "ДополнительнаяИнформация") Тогда
							ВывестиТаблицей(ТаблицаДанных, ТабличныйДокумент, Макет, ТекущийРаздел, 1, Ложь);
						ИначеЕсли ТекущийРаздел = "КонтактнаяИнформация" Тогда
							ВывестиТаблицей(ТаблицаДанных, ТабличныйДокумент, Макет, ТекущийРаздел, 1, Ложь);
						ИначеЕсли ТекущийРаздел = "КонтактныеЛица" Тогда
				    		ОбластьШапкаКонтактногоЛица = Макет.ПолучитьОбласть("ШапкаКонтактныеЛица");
				    		ОбластьОсновныеДанныеКонтактногоЛица = Макет.ПолучитьОбласть("ОсновныеДанныеКонтактныеЛица");
				    		ВывестиОбластьПробела = Ложь;
							Для Каждого КонтактныеЛицаКонтрагента Из ТаблицаДанных Цикл
				    			Если ВывестиОбластьПробела Тогда
				    				ТабличныйДокумент.Вывести(ОбластьОтступа1, 2);	
				    			Иначе
				    				ВывестиОбластьПробела = Истина;
				    			КонецЕсли;
				    			ОбластьШапкаКонтактногоЛица.Параметры.Ссылка = КонтактныеЛицаКонтрагента.Ссылка;
				    			ТабличныйДокумент.Вывести(ОбластьШапкаКонтактногоЛица, 1);	
				    			
				    			ОбластьОсновныеДанныеКонтактногоЛица.Параметры.Заполнить(КонтактныеЛицаКонтрагента);
				    			ТабличныйДокумент.Вывести(ОбластьОсновныеДанныеКонтактногоЛица, 2);
								
								Если ВыводитьКонтактнуюИнформациюКонтактныхЛиц Тогда
									ТаблицаДанныхКонтактногоЛица = ТаблицаДанныхРаздела("КонтактнаяИнформация", ТекущийОбъект.Ссылка,
																								СтруктураНастроек.ВыводитьТолькоОсновные, КонтактныеЛицаКонтрагента.Ссылка);
									Если ТаблицаДанныхКонтактногоЛица.Количество() > 0 Тогда 
										ТабличныйДокумент.Вывести(ОбластьОтступа1, 2);
										ВывестиТаблицей(ТаблицаДанныхКонтактногоЛица, ТабличныйДокумент, Макет, "КонтактнаяИнформацияКЛ", 2);
									КонецЕсли;
									БылаВыведенаКонтактнаяИнформация = (ТаблицаДанныхКонтактногоЛица.Количество() > 0);
				    			КонецЕсли;
				    			Если ВыводитьПодтверждающиеДокументыКонтактныхЛиц Тогда
									ТаблицаДанныхКонтактногоЛица = ТаблицаДанныхРаздела("ПодтверждающиеДокументы", ТекущийОбъект.Ссылка, 
																								СтруктураНастроек.ВыводитьТолькоОсновные, КонтактныеЛицаКонтрагента.Ссылка);
									Если ТаблицаДанныхКонтактногоЛица.Количество() > 0 Тогда 
										Если (Не ВыводитьКонтактнуюИнформациюКонтактныхЛиц) Или (БылаВыведенаКонтактнаяИнформация) Тогда
											ТабличныйДокумент.Вывести(ОбластьОтступа1, 2);						
										КонецЕсли;
										ВывестиТаблицей(ТаблицаДанныхКонтактногоЛица, ТабличныйДокумент, Макет, "ПодтверждающиеДокументыКЛ", 2);
									КонецЕсли;	
				    			КонецЕсли;
				    			Если ВыводитьДополнительнуюИнформациюКонтактныхЛиц Тогда
				    				ТаблицаДанныхКонтактногоЛица = ТаблицаДанныхРаздела("ДополнительнаяИнформация", ТекущийОбъект.Ссылка, 
																								СтруктураНастроек.ВыводитьТолькоОсновные ,КонтактныеЛицаКонтрагента.Ссылка);
									Если ТаблицаДанныхКонтактногоЛица.Количество() > 0 Тогда 
										ТабличныйДокумент.Вывести(ОбластьОтступа1, 2);
										ВывестиТаблицей(ТаблицаДанныхКонтактногоЛица, ТабличныйДокумент, Макет, "ДополнительнаяИнформацияКЛ", 2);
									КонецЕсли;	
				    			КонецЕсли;	
				    		КонецЦикла;
						ИначеЕсли ТекущийРаздел = "ПодтверждающиеДокументы"	Тогда
							ВывестиТаблицей(ТаблицаДанных, ТабличныйДокумент, Макет, ТекущийРаздел, 1, Ложь);
						Иначе
							ВывестиТаблицей(ТаблицаДанных, ТабличныйДокумент, Макет, ТекущийРаздел, 1);
						КонецЕсли;
			 		КонецЕсли;
			    КонецЕсли;	
			КонецЦикла;
			ТабличныйДокумент.ОтображатьСетку = Ложь;
			ТабличныйДокумент.ПолеСверху = 10;
			ТабличныйДокумент.ПолеСлева = 20;
			ТабличныйДокумент.ПолеСнизу = 10;
			ТабличныйДокумент.ПолеСправа = 10;
			ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
			ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();
		КонецЕсли;
		// Отметим конец области документа.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийОбъект);
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;	
КонецФункции // СформироватьТабличныйДокумент()

// Формирует на основе текста запроса таблицу и выводит ее в табличный документ.
// Параметры:
//	ТаблицаДанных - ТаблицаЗначений - таблица значений, на основании которой формируется табличный документ;
//	ТабличныйДокумент - табличный документ, в который выводится таблица;
//	Макет - макет, с помощью которого формируются строки таблицы;
//	Раздел - Строка - название раздела информации о контрагенте, в который выводится таблица;
//	Уровень - Число - уровень группировки таблицы в документе;
//	ЕстьШапка - Булево - указывает, есть ли в таблице шапка;
//  РаскраситьТаблицу - Число - указывает, какие части таблицы раскрасить. Имеет значения:
//                    "0" - не раскрашивать ни шапку, ни строки таблицы;
//                    "1" - раскрасить шапку таблицы;
//                    "2" - раскрасить строки таблицы;
//                    "3" - раскрасить и шапку, и строки таблицы.
Процедура ВывестиТаблицей(ТаблицаДанных, ТабличныйДокумент, Макет, Раздел, Уровень, ЕстьШапка = Истина)
	Если ЕстьШапка Тогда
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка"+Раздел);
		ТабличныйДокумент.Вывести(ОбластьШапка, Уровень);
	КонецЕсли;
	
	Для Каждого СтрокаТаблицыДанных Из ТаблицаДанных Цикл
		Попытка
			ПоУмолчанию = СтрокаТаблицыДанных.ЗначениеПоУмолчанию;
		Исключение
			ПоУмолчанию = Ложь;
		КонецПопытки;

		ОбластьСтроки = Макет.ПолучитьОбласть("Строка" + Раздел + ?(ПоУмолчанию, "ПоУмолчанию", ""));
		ОбластьСтроки.Параметры.Заполнить(СтрокаТаблицыДанных);
		
		ТабличныйДокумент.Вывести(ОбластьСтроки, Уровень);
	КонецЦикла;	
КонецПроцедуры// ВывестиТаблицей()	

// Выбирает данные по разделу информации.
// Параметры:
//  Раздел - Строка - НазваниеРаздела
//  Контрагент - СправочникСсылка.Контрагент - контрагент, по которому собирается информация;
//  КонтактноеЛицо - СправочникСсылка.КонтактноеЛицо - контактное лицо, по которому собирается информация;
// Возвращаемое значение
//  ТаблицаЗначений - таблица, в которую выгружены результаты запроса.
Функция ТаблицаДанныхРаздела(Раздел, Контрагент, ВыводитьТолькоОсновные, КонтактноеЛицо = Неопределено)
	ВозвращаемоеЗначение = Новый ТаблицаЗначений();
	Если Раздел = "РегистрационнаяИнформация" Тогда
		НетСтрок = Истина;
		ВозвращаемоеЗначение.Колонки.Добавить("ИННКПП");
		ВозвращаемоеЗначение.Колонки.Добавить("КодИМНС");
		ВозвращаемоеЗначение.Колонки.Добавить("КодПоОКПО");
		СтрокаВозвращаемоеЗначение = ВозвращаемоеЗначение.Добавить();
		Если ЗначениеЗаполнено(Контрагент.ИНН) Тогда
			ИННКПП = СокрЛП(Контрагент.ИНН);
			Если ЗначениеЗаполнено(Контрагент.КПП) Тогда
				ИННКПП = ИННКПП + " / "+ СокрЛП(Контрагент.КПП);
			КонецЕсли;
			НетСтрок = Ложь;
		КонецЕсли;
		Если ЗначениеЗаполнено(Контрагент.КодИМНС) Тогда
			НетСтрок = Ложь;
		КонецЕсли;
		Если ЗначениеЗаполнено(Контрагент.КодПоОКПО) Тогда
			НетСтрок = Ложь;
		КонецЕсли;
		Если НетСтрок Тогда
			ВозвращаемоеЗначение.Очистить();
		Иначе
			СтрокаВозвращаемоеЗначение.ИННКПП = ИННКПП;
			СтрокаВозвращаемоеЗначение.КодИМНС = Контрагент.КодИМНС;
			СтрокаВозвращаемоеЗначение.КодПоОКПО = Контрагент.КодПоОКПО;
		КонецЕсли;
	ИначеЕсли Раздел = "РегистрационнаяИнформацияЧастноеЛицо" Тогда
		НетСтрок = Истина;
		ВозвращаемоеЗначение.Колонки.Добавить("ДатаРождения");
		Если ЗначениеЗаполнено(Контрагент.ДатаРождения) Тогда
			СтрокаВозвращаемоеЗначение = ВозвращаемоеЗначение.Добавить();
			СтрокаВозвращаемоеЗначение.ДатаРождения = Формат(Контрагент.ДатаРождения, "ДЛФ = Д");
		КонецЕсли;
	ИначеЕсли Раздел = "ДополнительнаяИнформация" Тогда
		ВозвращаемоеЗначение.Колонки.Добавить("Комментарий");
		Если КонтактноеЛицо = Неопределено Тогда
			Комментарий = Контрагент.Комментарий;
		Иначе
			Комментарий = КонтактноеЛицо.Комментарий;
		КонецЕсли;
		Если ЗначениеЗаполнено(Комментарий) Тогда
			СтрокаВозвращаемоеЗначение = ВозвращаемоеЗначение.Добавить();
			СтрокаВозвращаемоеЗначение.Комментарий = Комментарий;
		КонецЕсли;
	Иначе	
		Запрос = Новый Запрос;
		// Создадим текст запроса
		Если Раздел = "КонтактнаяИнформация" Тогда
			ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КонтрагентыКонтактнаяИнформация.Ссылка,
			|	КонтрагентыКонтактнаяИнформация.Тип,
			|	КонтрагентыКонтактнаяИнформация.Вид,
			|	КонтрагентыКонтактнаяИнформация.Представление
			|ИЗ
			|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
			|ГДЕ
			|	КонтрагентыКонтактнаяИнформация.Ссылка = &Объект";
		ИначеЕсли Раздел = "КонтактныеЛица" Тогда
			ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫБОР
			|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.КонтактноеЛицо)
			|				И Контрагенты.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЧастноеЛицо)
			|			ТОГДА Контрагенты.Должность
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Должности.Неопределена)
			|	КОНЕЦ КАК Должность,
			|	Контрагенты.ДатаРождения КАК ДатаРождения,
			|	КонтактныеЛица.КонтактноеЛицо КАК Ссылка
			|ИЗ
			|	РегистрСведений.КонтактныеЛица КАК КонтактныеЛица
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
			|		ПО КонтактныеЛица.КонтактноеЛицо = Контрагенты.Ссылка
			|ГДЕ
			|	КонтактныеЛица.Владелец = &Объект";
			Запрос.УстановитьПараметр("Объект", Контрагент);
		ИначеЕсли Раздел = "Кураторы" Тогда
			ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Кураторы.Куратор,
			|	Кураторы.Договор
			|ИЗ
			|	РегистрСведений.Кураторы КАК Кураторы
			|ГДЕ
			|	Кураторы.Контрагент = &Контрагент";
			Запрос.УстановитьПараметр("Контрагент", Контрагент);
		ИначеЕсли Раздел = "БанковскиеСчета" Тогда
			ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БанковскиеСчета.Ссылка,
			|	БанковскиеСчета.ВалютаДенежныхСредств,
			|	БанковскиеСчета.НомерСчета,
			|	БанковскиеСчета.Банк.Ссылка КАК БанкСсылка,
			|	БанковскиеСчета.Банк.КоррСчет КАК КоррСчет,
			|	БанковскиеСчета.Банк.Код КАК БИК,
			|	ВЫБОР
			|		КОГДА БанковскиеСчета.Ссылка = &ОсновнойРеквизит
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ЗначениеПоУмолчанию
			|ИЗ
			|	Справочник.БанковскиеСчета КАК БанковскиеСчета
			|ГДЕ
			|	БанковскиеСчета.Владелец = &Контрагент
			|	ОтборПоОсновномуРеквизиту
			|УПОРЯДОЧИТЬ ПО
			|	ЗначениеПоУмолчанию УБЫВ";
			Запрос.УстановитьПараметр("ОсновнойРеквизит", Контрагент.ОсновнойБанковскийСчет);
		ИначеЕсли Раздел = "ДоговорыКонтрагента" Тогда
			ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДоговорыВзаиморасчетов.Ссылка,
			|	ДоговорыВзаиморасчетов.Наименование,
			|	ДоговорыВзаиморасчетов.ВалютаВзаиморасчетов,
			|	ДоговорыВзаиморасчетов.ПроцентПредоплаты,
			|	ДоговорыВзаиморасчетов.Основной КАК ЗначениеПоУмолчанию
			|ИЗ
			|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
			|ГДЕ
			|	ДоговорыВзаиморасчетов.Владелец = &Контрагент
			|	ОтборПоОсновномуРеквизиту
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЗначениеПоУмолчанию УБЫВ";
		ИначеЕсли Раздел = "ПодтверждающиеДокументы" Тогда
			ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПодтверждающиеДокументы.Ссылка,
			|	ПодтверждающиеДокументы.Наименование,
			|	ПодтверждающиеДокументы.Серия,
			|	ПодтверждающиеДокументы.Номер,
			|	ПодтверждающиеДокументы.КемВыдан,
			|	ПодтверждающиеДокументы.ДатаВыдачи
			|ИЗ
			|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
			|ГДЕ
			|	ПодтверждающиеДокументы.Владелец = &Объект";
		ИначеЕсли Раздел = "ДисконтныеКарты" Тогда
			ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Карточки.Ссылка КАК Карточка,
			|	СУММА(ЕСТЬNULL(НакопленияПоКарточкамКонтрагентовОбороты.СуммаОборот, 0)) КАК Сумма
			|ИЗ
			|	Справочник.Карточки КАК Карточки
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НакопленияПоКарточкамКонтрагентов.Обороты КАК НакопленияПоКарточкамКонтрагентовОбороты
			|		ПО (НакопленияПоКарточкамКонтрагентовОбороты.Карточка = Карточки.Ссылка)
			|ГДЕ
			|	Карточки.Объект = &Контрагент
			|
			|СГРУППИРОВАТЬ ПО
			|	Карточки.Ссылка";
		КонецЕсли;
		
		// Установим параметры запроса и при необходимости корректируем его текст.
		
		// Если есть отбор по основным значениям раздела.
		Если ВыводитьТолькоОсновные Тогда
			Если СтрНайти(ТекстЗапроса, "ОтборПоОсновномуРеквизиту")>0 Тогда
				Если Раздел = "БанковскиеСчета" Тогда
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ОтборПоОсновномуРеквизиту", "И БанковскиеСчета.Ссылка = &ОсновнойРеквизит");
				ИначеЕсли Раздел = "ДоговорыКонтрагента" Тогда
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ОтборПоОсновномуРеквизиту", "И ДоговорыВзаиморасчетов.Ссылка = &ОсновнойРеквизит");
				КонецЕсли;
			КонецЕсли;
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ОтборПоОсновномуРеквизиту", "");
		КонецЕсли;
		
		// У контактной информации и подтверждающих документов
		// может быть отбор или по контрагенту, или по контактной информации.
		Если (Раздел = "КонтактнаяИнформация") ИЛИ (Раздел = "ПодтверждающиеДокументы") Тогда
			Если КонтактноеЛицо = Неопределено Тогда
				Запрос.УстановитьПараметр("Объект", Контрагент);
			Иначе
				Запрос.УстановитьПараметр("Объект", КонтактноеЛицо);
			КонецЕсли;	
		Иначе
			Запрос.УстановитьПараметр("Контрагент", Контрагент);					   
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапроса;
		
		ВозвращаемоеЗначение = Запрос.Выполнить().Выгрузить();
		
		// Дополнительные преобразования 
		Если ВозвращаемоеЗначение.Количество() > 0 Тогда
			// Для подтверждающих документов сформируем дополнительную колонку "Строка", куда будет добавлено представление.
			Если Раздел = "ПодтверждающиеДокументы" Тогда
				ВозвращаемоеЗначение.Колонки.Добавить("Строка");
				Для Каждого СтрокаТаблицы Из ВозвращаемоеЗначение Цикл
					СтрокаТаблицы.Строка = " " + (ВозвращаемоеЗначение.Индекс(СтрокаТаблицы)+1) + ". " + СокрЛП(СтрокаТаблицы.Наименование)
															  + ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Серия),""," " + "серия" + " " +СокрЛП(СтрокаТаблицы.Серия))
															  + ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номер),""," " + "№"+СокрЛП(СтрокаТаблицы.Номер))
															  + ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.КемВыдан),""," " + "выдан" + " " +СокрЛП(СтрокаТаблицы.КемВыдан))
															  + ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаВыдачи),"", " "+ НСтр("ru = 'дата выдачи'") + " " 
															  													+Формат(СтрокаТаблицы.ДатаВыдачи,"ДЛФ = Д"));
				КонецЦикла;
			// Для контактных лиц соберем кураторов.
			ИначеЕсли Раздел = "КонтактныеЛица" Тогда
				ВозвращаемоеЗначение.Колонки.Добавить("СтрокаКураторы");
				Для Каждого СтрокаТаблицы Из ВозвращаемоеЗначение Цикл
					ТаблицаКураторов = ТаблицаДанныхРаздела("Кураторы", Контрагент, ВыводитьТолькоОсновные, СтрокаТаблицы.Ссылка);
	    			СтрокаКураторов = "";
	    			Для Каждого СтрокаТаблицыКураторов Из ТаблицаКураторов Цикл
    					Если Не СтрокаКураторов = "" Тогда
    						СтрокаКураторов = СтрокаКураторов + ", ";
    					КонецЕсли;
    					СтрокаКураторов = СтрокаКураторов + СокрЛП(СтрокаТаблицыКураторов.Куратор.Наименование);
					КонецЦикла;
					СтрокаТаблицы.СтрокаКураторы = СтрокаКураторов;
				КонецЦикла;										  
			КонецЕсли;		
		КонецЕсли;
	КонецЕсли;
	Возврат ВозвращаемоеЗначение;
КонецФункции// ТаблицаДанныхРаздела()	

#КонецЕсли
